Revit 2027 API
StructuralSectionSigmaProfileWithFold.FoldWidth Property
 Fold segment width.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FoldWidth { get; set; }
Public Property FoldWidth As Double
	Get
	Set
public:
property double FoldWidth {
	double get ();
	void set (double value);
}
member FoldWidth : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionSigmaProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace